/*
 * 	자바에서 지원하는 제어문
 * 	= 조건문: 원하는 명령만 수행할 수 있게 만든다, 에러예상
 * 			= 단일 조건문 (true) => 독립문장
 * 			= 선택 조건문 ( true, false ) => 삼항연산자
 * 			= 다중 조건문 => 한 개의 문장	

 * 
 * 	자바에서 지원하는 모든 제어문은 한 개의 문장만 제어할 수 있다.
 * 	=> 여러개의 문장을 제어할 때는 {}로 감싼다.
 * 
 * 	= 선택문: 원하는 명령 한 개를 처리한다.
 * 	switch(정수 / 문자/ 문자열) => 다른 언어는ㄴ 사용할 수 없다 (문자열) => 다중 조건문
 * 	{
 * 		case "LOGIN" :
 * 				login처리
 * 		case "JOIN":
 * 				회원가입
 * 		case "RESERVE":
 * 				예매처리
 * 	}
 * 
 *  = 반복문: 중복 코드 제거
 *  	= while: 반복횟수가 지정이 안된 경우 (web) => 오라클
 *  	= do~while: 반드시 한 번 이상 수행할 때
 *  	= for: 반복횟수가 지정됐을 때
 *  
 *  반복제어문: 반복문을 중단할 때, 특정 부분을 제외할 경우
 *  	= break => 반복문 종료
 *  	= continue => 특정부분을 제외
 */
public class 제어문기초 {

	public static void main(String[] args) {

	}

}
