/*
 * 클래스를 만드는 목적
 * ==============
 * 1. 재사용이 가능 (상속, 포함)
 * 2. 클래스가 가지고 있는 데이터를 보호 (캡슐화)
 * 3. 변경이 가능, 추가가 가능 (다형성)
 *    =========================
 *      유지보수
 *      ====== 신뢰성
 * ===========================================
 *
 * 
 * 
 * 클래스의 구성요소
 * ============
 *   변수 (page 246)
 *     = 인스턴스 변수: new를 이용할 때마다 메모리가 생성
 *     = 클래스 변수: static => 컴파일시 자동으로 메모리 생성
 *     = 지역 변수: 메서드 {} 안에서 생성
 *   메서드: 한 가지 기능을 수행하는 명령문의 집합
 *   생성자
 */
public class MainClass4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
